src/Documents/ПоступлениеОплатыОтКонтрагента/ПоступлениеОплатыОтКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеОплатыОтКонтрагента</name>
  <registerRecords>AccumulationRegister.УП_РасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>CatalogRef.СпособыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/УП_СостоянияПроектов/УП_СостоянияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УП_СостоянияПроектов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/УП_РасчетыСКонтрагентами/УП_РасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УП_РасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/СостоянияПроектов/СостоянияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПроектов</name>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Корректировки</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПоступлениеОплатыОтКонтрагента/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////////
//// РАЗДЕЛ ПРОЦЕДУР И ФУНКЦИЙ

// Обработка проведения документа.
// ................................................................................
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	// регистр ВзаиморасчетыСКонтрагентами Расход
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Для каждого ТекСтрока Из Проекты Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Проект) Тогда
			Движение                      = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
			Движение.ВидДвижения          = ВидДвиженияНакопления.Расход;
			Движение.Период               = Дата;
			Движение.Контрагент           = Контрагент;
			Движение.ВалютаВзаиморасчетов = ТекСтрока.Валюта;
			Движение.ВалютаУчета          = ВалютаУчета;
			Движение.Проект               = ТекСтрока.Проект;
			Движение.СуммаВзаиморасчетов  = ТекСтрока.Сумма;
			Движение.СуммаВВалютеУчета    = ТекСтрока.Сумма * УП_ОбщегоНазначения_Сервер.ПолучитьАктуальныйКурсВалюты(Дата, ТекСтрока.Валюта);
		КонецЕсли;
	КонецЦикла;
	
	// регистр УП_СостоянияПроектов Приход
	Движения.УП_СостоянияПроектов.Записывать = Истина;
	
	// очистим движения текущего документа
	Движения.УП_РасчетыСКонтрагентами.Очистить();
	Движения.УП_РасчетыСКонтрагентами.Записать();
	
	Движения.УП_СостоянияПроектов.Очистить();
	Движения.УП_СостоянияПроектов.Записать();
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		ПараметрыАналитики = Новый Структура();
		ПараметрыАналитики.Вставить("Контрагент", Контрагент);
		ПараметрыАналитики.Вставить("Клиент"    , ТекСтрокаПроекты.Клиент);
		ПараметрыАналитики.Вставить("Проект"    , ТекСтрокаПроекты.Проект);
		АналитикаУчетаПоКонтрагентам = УП_РаботаСДокументамиСервер.ЗначениеКлючаАналитики(ПараметрыАналитики);
		
		Если АналитикаУчетаПоКонтрагентам = Неопределено Тогда
			Продолжить;
			Отказ = Истина;
			Сообщить("Не удалось определить аналитику учета по контрагенту. Строка: " + Строка(ТекСтрокаПроекты.НомерСтроки));
		КонецЕсли;
		ЗапросВыполненныхПроектов = Новый Запрос;
		ЗапросВыполненныхПроектов.Текст =
		"ВЫБРАТЬ
		|	УП_СостоянияПроектов.АналитикаУчетаПоКонтрагентам
		|ИЗ
		|	РегистрСведений.УП_СостоянияПроектов КАК УП_СостоянияПроектов
		|ГДЕ
		|	УП_СостоянияПроектов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияПроектов.Выполнен)
		|	И УП_СостоянияПроектов.Период < &МоментВремени
		|	И УП_СостоянияПроектов.АналитикаУчетаПоКонтрагентам = &АналитикаУчетаПоКонтрагентам";
		ЗапросВыполненныхПроектов.УстановитьПараметр("МоментВремени"               , Дата);
		ЗапросВыполненныхПроектов.УстановитьПараметр("АналитикаУчетаПоКонтрагентам", АналитикаУчетаПоКонтрагентам);
		РезультатЗапросаВыполненныхПроектов = ЗапросВыполненныхПроектов.Выполнить();
		Если НЕ РезультатЗапросаВыполненныхПроектов.Пустой() Тогда
			ЗапросЗакрытыхПроектов = Новый Запрос;
			ЗапросЗакрытыхПроектов.Текст =
			"ВЫБРАТЬ
			|	УП_СостоянияПроектовСрезПоследних.АналитикаУчетаПоКонтрагентам
			|ИЗ
			|	РегистрСведений.УП_СостоянияПроектов.СрезПоследних(
			|			&МоментВремени,
			|			АналитикаУчетаПоКонтрагентам = &АналитикаУчетаПоКонтрагентам
			|				И Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияПроектов.Закрыт)) КАК УП_СостоянияПроектовСрезПоследних";
			ЗапросЗакрытыхПроектов.УстановитьПараметр("МоментВремени"               , ?(Режим = РежимПроведенияДокумента.Оперативный, Неопределено, МоментВремени()));
			ЗапросЗакрытыхПроектов.УстановитьПараметр("АналитикаУчетаПоКонтрагентам", АналитикаУчетаПоКонтрагентам);
			РезультатЗапросаЗакрытыхПроектов = ЗапросЗакрытыхПроектов.Выполнить();
			Если НЕ РезультатЗапросаЗакрытыхПроектов.Пустой() Тогда
				Сообщить("Проект " + Строка(ТекСтрокаПроекты.Проект) + " уже является закрытым. Убедитесь, что время документа правильное. Строка: " + Строка(ТекСтрокаПроекты.НомерСтроки));
				Отказ = Истина;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СУММА(УП_РасчетыСКонтрагентамиОстатки.СуммаОстаток) КАК ДолгКонтрагента
			|ИЗ
			|	РегистрНакопления.УП_РасчетыСКонтрагентами.Остатки(&МоментВремени, АналитикаУчетаПоКонтрагентам = &АналитикаУчетаПоКонтрагентам) КАК УП_РасчетыСКонтрагентамиОстатки";
			Запрос.УстановитьПараметр("МоментВремени"               , ?(Режим = РежимПроведенияДокумента.Оперативный, Неопределено, МоментВремени()));
			Запрос.УстановитьПараметр("АналитикаУчетаПоКонтрагентам", АналитикаУчетаПоКонтрагентам);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ДолгКонтрагентаПоПроекту = Выборка.ДолгКонтрагента;
			Если ТекСтрокаПроекты.Сумма >= ДолгКонтрагентаПоПроекту Тогда
				Движение                              = Движения.УП_СостоянияПроектов.Добавить();
				Движение.Период                       = Дата;
				Движение.АналитикаУчетаПоКонтрагентам = АналитикаУчетаПоКонтрагентам;
				Движение.Состояние                    = Перечисления.СостоянияПроектов.Закрыт;
			КонецЕсли;
			Если НЕ Отказ Тогда
				Движения.УП_СостоянияПроектов.Записывать = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// регистр УП_ВзаиморасчетыСКонтрагентами Приход
	Движения.УП_РасчетыСКонтрагентами.Записывать = Истина;
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		ПараметрыАналитики = Новый Структура();
		ПараметрыАналитики.Вставить("Контрагент", Контрагент);
		ПараметрыАналитики.Вставить("Клиент"    , ТекСтрокаПроекты.Клиент);
		ПараметрыАналитики.Вставить("Проект"    , ТекСтрокаПроекты.Проект);
		
		Движение                              = Движения.УП_РасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения                  = ВидДвиженияНакопления.Расход;
		Движение.Период                       = Дата;
		Движение.АналитикаУчетаПоКонтрагентам = УП_РаботаСДокументамиСервер.ЗначениеКлючаАналитики(ПараметрыАналитики);
		Движение.Валюта                       = ТекСтрокаПроекты.Валюта;
		Движение.Сумма                        = ТекСтрокаПроекты.Сумма;
	КонецЦикла;
	
КонецПроцедуры

// Обработка события "при записи".
// ................................................................................
Процедура ПриЗаписи(Отказ)
	
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Проекты.Итог("Сумма");
	
КонецПроцедуры
